In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('US_Baby_Names_right.csv')
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 42.6+ MB

In [10]:
df.drop(['Unnamed: 0', 'Id'], inplace=True, axis=1)
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [11]:
df.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [30]:
names = df.groupby('Name').sum()
names.drop('Year', axis=1, inplace=True)
names.sort_values("Count", ascending = 0).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

In [31]:
df.Name.nunique()

17632

In [34]:
#names.Count.idxmax()
names[names.Count == names.Count.max()]

        Count
Name
Jacob  242874

In [36]:
names[names.Count == names.Count.min()].count()
#len(names[names.Count == names.Count.min()])

Count    2578
dtype: int64

In [45]:
names[names.Count == names.Count.median()].head()

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49

In [46]:
names.Count.std()

11006.069467891111

In [47]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000